[
  {
    "key": 1,
    "title": "We Believe",
    "description": "The Scriptures are inspired by the Holy Spirit.",
    "verses": "2 Timothy 3:15-17; 1 Thessalonians 2:13; 2 Peter 1:21"
  },
  {
    "key": 2,
    "title": "We Believe",
    "description": "In triune God (Father, Son, and the Holy Sprit).",
    "verses": "Deuteronomy 6:4; Isaiah 43:10-11; Matthew 28:19; Luke 3:22"
  },
  {
    "key": 3,
    "title": "We Believe",
    "description": "Jesus is God and man, a being who possesses the combined attributes of a deity and of a human.",
    "verses": "Matthew 1:23; Luke 1:31,35"
  },
  {
    "key": 4,
    "title": "We Believe",
    "description": "Through Adam, sin entered into the world.",
    "verses": "Genesis 1:26-27; Genesis 2:17; Genesis 3:6; Romans 5:12-19"
  },
  {
    "key": 5,
    "title": "We Believe",
    "description": "Every Person has the authority to become the children of God.",
    "verses": "Luke 24:47; John 3:3; Romans 10:13-15; Ephesians 2:8; Titus 2:11, 3:5-7"
  },
  {
    "key": 6,
    "title": "We Believe",
    "description": "and practice two ordinances... Water Baptism by immersion is commanded by the Scriptures. All who repent and believe on Christ as Savior and Lord are to be baptized. Holy Communion (the Lord's Supper) as a symbolic remembrance of Christ's suffering and death for our salvation.",
    "verses": "Matthew 28:19; Mark 16:16; Acts 10:47-48; Romans 6:4; 1 Corinthians 11:26"
  },
  {
    "key": 7,
    "title": "We Believe",
    "description": "all believers are entitled to and should ardently expect and earnestly seek the promise of the Father, the baptism in the Holy Spirit and fire, according to the command of our Lord Jesus Christ.",
    "verses": "Luke 24:49; Acts 1:4,8; 1 Corinthians 12:1-31"
  },
  {
    "key": 8,
    "title": "We Believe",
    "description": "The External evidence of the Holy Spirit is the Gift of Tongues.",
    "verses": "Acts 2:4"
  },
  {
    "key": 9,
    "title": "We Believe",
    "description": "Sanctification Initially Occurs at Salvation and is not only a declaration that a believer is holy, but also a progressive lifelong process of separating from evil as believers continually draw closer to God and become more Christlike.",
    "verses": "Romans 12:1-2; 1 Thessalonians 5:23; Hebrews 13:12"
  },
  {
    "key": 10,
    "title": "We Believe",
    "description": "The Church has a Mission to save all the people.",
    "verses": "Acts 1:8; Matthew 28:19-20; 1 Corinthians 12:13"
  },
  {
    "key": 11,
    "title": "We Believe",
    "description": "A Divinely Called and Scripturally Ordained Leadership Ministry Serves the Church. The Bible teaches that each of us under leadership must commit ourselves to reach others for Christ, to worship Him with other believers, and to build up or edify the body of believers-the Church.",
    "verses": "Mark 16:15-20; John 4:23-24; Ephesians 4:11-16"
  },
  {
    "key": 12,
    "title": "We Believe",
    "description": "Divine Healing is an integral part of the gospel. Deliverance from sickness is provided for in the atonement, and is the privilege of all believers.",
    "verses": "Isaiah 53:4-5; Matthew 8:16-17; James 5:14-16"
  },
  {
    "key": 13,
    "title": "We Believe",
    "description": "When the trumphet is blown all who died in Christ will been risen first, and those who are living in Christ will be transformed and taken to the Lord Jesus Christ.",
    "verses": "1 Thessalonians 4:16-17; Romans 8:23; Titus 2:13; 1 Corinthians 15:51-52"
  },
  {
    "key": 14,
    "title": "We Believe",
    "description": "in The Millennial Reign of Christ.",
    "verses": "Zechariah 14:5; Matthew 24:27; Ezekiel 37:21-22; Zephaniah 3:19-20"
  },
  {
    "key": 15,
    "title": "We Believe",
    "description": "A Final Judgment Will Take Place for those who have rejected Christ. They will be judged for their sin and consigned to eternal punishment in a lake of fire.",
    "verses": "Matthew 25:46; Mark 9:43-48; Revelation 19:20, 20:11-15, 21:8"
  },
  {
    "key": 16,
    "title": "We Believe",
    "description": "and look forward to the perfect New Heavens and a New Earth that Christ is preparing for all people, of all time, who have accepted Him. We will live and dwell with Him there forever following His millennial reign on Earth. 'And so shall we forever be with the Lord!",
    "verses": "2 Peter 3:13; Revelation 21, 22"
  }
]
